Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: These actions will ripen in the abodes of the sphere of limitless space, the sphere of limitless consciousness, the sphere of nothing whatsoever, and the sphere of neither notion nor no notion, respectively.

source: ལས་འདི་ལྟ་བུ་ནི་འཁོར་བའི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This action will ripen within the abodes of saṃsāra.

source: ལས་འདི་ལྟ་བུ་ནི་མྱ་ངན་ལས་འདའ་བར་ཞུགས་པའི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This action will ripen in the abode of those who enter nirvāṇa.’

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་དང་གནས་ཀྱི་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of abodes.

source: དེ་བཞིན་གཤེགས་པ་གནས་དང་གནས་ཀྱི་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of abodes,

source: བསྐལ་པར་ལན་གསུང་བ་ནས། དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: he can respond for an eon, and so forth, up until . . . . Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་དང་གནས་ཀྱི་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of abodes.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་གནས་དང་གནས་ཀྱི་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of abodes.

source: དེ་བཞིན་གཤེགས་པ་གནས་དང་གནས་ཀྱི་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of abodes,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་དང་གནས་ཀྱི་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of abodes.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ཤིང་དོན་མ་ཡིན་པ་བཟློག་ལ།
en: He accomplished the welfare of an immeasurable number of beings and refrained from harming them.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས། བདེ་བ་ལ་བཙུད་པ་ནི་གནས་དང་གནས་ཀྱི་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: He has freed innumerable beings from suffering and established them in happiness. That is the knowledge of cessation as related to knowledge of abodes.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་དང་གནས་ཀྱི་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of abodes.

source: དེ་བཞིན་གཤེགས་པ་གནས་དང་གནས་ཀྱི་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of abodes,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་དང་གནས་ཀྱི་ཤེས་པ་འགོག་པ་ཤེས་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of abodes.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་གནས་དང་གནས་ཀྱི་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ།
en: Householder, the Thus-Gone One [correctly understands] the knowledge of cessation by which he knows, understands, and actualizes the knowledge of abodes.

source: དེ་བཞིན་གཤེགས་པས་གནས་དང་གནས་ཀྱི་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of abodes,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྒྱུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of causes.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དང་དམིགས་པ་གང་དག་གིས་སེམས་ཅན་དག་སེམས་ཅན་དམྱལ་བའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མངོན་དུ་ཡང་དག་པར་བྱེད་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དང་། དམིགས་པ་དེ་དག་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, the Thus-Gone One correctly understands the causes, conditions, and reasons that actualize the ripening of karma for beings to be born in hell.

source: འདི་ནི་དུད་འགྲོའི་རྣམ་པར་སྨིན་པ། གཤིན་རྗེའི་རྣམ་པར་སྨིན་པ། ལྷ་མ་ཡིན་གྱི་རྣམ་པར་སྨིན་པ། མིའི་རྣམ་པར་སྨིན་པ། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་རྣམ་པར་སྨིན་པ། སུམ་ཅུ་རྩ་གསུམ་གྱི་རྣམ་པར་སྨིན་པ། འཐབ་བྲལ་གྱི་རྣམ་པར་སྨིན་པ། དགའ་ལྡན་གྱི་རྣམ་པར་སྨིན་པ། འཕྲུལ་དགའི་རྣམ་པར་སྨིན་པ། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་རྣམ་པར་སྨིན་པ། ཚངས་རིས་དང་། ཚངས་པའི་མདུན་ན་འདོན་དང་། ཚངས་འཁོར་དང་། ཚངས་པ་ཆེན་པོའི་རྣམ་པར་སྨིན་པ། འོད་དང་། འོད་ཆུང་དང་། ཚད་མེད་འོད་དང་། འོད་གསལ་གྱི་རྣམ་པར་སྨིན་པ། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་ཀྱི་རྣམ་པར་སྨིན་པ། ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བའི་རྣམ་པར་སྨིན་པ་དང་། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། གྱ་ནོམ་སྣང་དང་། ཤིན་ཏུ་མཐོང་དང་། འོག་མིན་གྱི་རྣམ་པར་སྨིན་པ། འདུ་ཤེས་མེད་པའི་སེམས་ཅན་གྱི་རྣམ་པར་སྨིན་པའི་རྒྱུ་གང་དང་རྐྱེན་གང་དང་། དམིགས་པ་གང་དག་གིས་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མངོན་དུ་ཡང་དག་པར་བྱེད་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དང་། དམིགས་པ་དེ་དག་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེརྒྱུ་གང་དང་རྐྱེན་གང་དང་དམིགས་པ་གང་དག་གིས་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མངོན་དུ་ཡང་དག་པར་བྱེད་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དང་། དམིགས་པ་དེ་དག་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Likewise, the Thus-Gone One correctly understands the causes, conditions, and reasons that actualize the ripening of karma for beings to be born in the animal realm, the realm of the Lord of Death, the demigod realm, the human realm, the Heaven of the Four Great Kings, the Heaven of the Thirty-Three, the Heaven Free from Strife, the Heaven of Joy, the Heaven of Delighting in Emanations, the Heaven of Making Use of Others’ Emanations, the Brahmā Realm, the Heaven of the High Priests of Brahmā, the Heaven of the Retinue of Brahmā, the Heaven of Great Brahmā, the Heaven of Light, the Heaven of Limited Light, the Heaven of Limitless Light, and the Luminous Heaven, the Heaven of Virtue, the Heaven of Limited Virtue, the Heaven of Limitless Virtue, and the Heaven of Perfected Virtue, the Greater Heaven, the Heaven of Lesser Greatness, the Heaven of Limitless Greatness, and the Heaven of Great Fruition, the Unlofty Heaven, the Heaven of No Hardship, the Sublime Heaven, the Gorgeous Heaven, and the Highest Heaven, and the abode of beings without notions, respectively. The Thus-Gone One correctly understands the causes, conditions, and reasons that actualize the ripening of karma.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྒྱུ་མཁྱེན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of causes.

source: དེ་བཞིན་གཤེགས་པ་རྒྱུ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of causes,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་རྣམས་ཀྱི་རྒྱུ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the causes of beings.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་རྒྱུ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of causes.

source: དེ་བཞིན་གཤེགས་པ་རྒྱུ་ཤེས་པ་དང་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of causes,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྒྱུ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of causes.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས། བདེ་བ་ལ་བཙུད་པ་ནི་རྒྱུ་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: He has freed innumerable beings from suffering and established them in happiness. That is the knowledge of cessation as related to knowledge of causes.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྒྱུ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of causes.

source: དེ་བཞིན་གཤེགས་པ་རྒྱུ་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of causes,

source: བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དག་ཏུ་ལན་གསུང་བ་ནས།
en: he can respond for an inexpressible number of inexpressible eons, and so forth, up until . . . .

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྒྱུ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of causes.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་རྒྱུ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the path that leads to cessation as related to knowledge of causes.

source: གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བ་མེད་པར་རྗེས་སུ་བལྟ་བར་གནས་པ་སྟེ།
en: This is so whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་རྒྱུ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of causes.

source: ཁྱིམ་བདག་རྒྱུ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: Householder, when the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of causes,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་སྨིན་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of ripening.

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་འདི་ལྟ་བུ་ནི་སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: ‘This ripening of karma will unfold among the beings in hell.

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་འདི་ལྟ་བུ་ནི་དུད་འགྲོའི་སྐྱེ་གནས་སུ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: This ripening of karma will unfold in the animal realm.

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་འདི་ལྟ་བུ་ནི་གཤིན་རྗེའི་འཇིག་རྟེན་དུ་རྣམ་པར་སྨིན་པར་འགྱུར་བ་ནས།
en: This ripening of karma will unfold in the realm of the Lord of Death, and so forth, up until . . . .

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་འདི་ལྟ་བུ་ནི། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་རྣམས་སུ་རྣམ་པར་སྨིན་པའི་བར་དུ་འགྱུར་རོ། །
en: This ripening of karma will unfold in the sphere of neither notion nor no notion.’

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་འདི་ལྟ་བུ་ནི་རྣམ་པར་སྨིན་པར་མི་འགྱུར་ཏེ།
en: ‘Such ripening of karma will not unfold.

source: ལས་དེའི་བྱེད་པ་པོ་ཡང་མེད་ལ།
en: That karma has no creator.

source: ལས་དེའི་རྣམ་པར་སྨིན་པ་སོ་སོར་མྱོང་བ་ཡང་མེད་དེ།
en: That ripening of karma will not be experienced.’

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་སྨིན་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of ripening.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྨིན་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of ripening,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་སྨིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of ripening.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་པ་རྣམས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་རྣམ་པར་སྨིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་དེ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands that knowledge of the origin as related to knowledge of ripening is acquired from accumulating roots of virtue in the presence of limitless blessed buddhas.

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་རྣམ་པར་སྨིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་གིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, moreover, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of ripening.

source: གལ་ཏེ་མི་རྟག་པར་རྗེས་སུ་བལྟ་བར་གནས་པ་ནས། གལ་ཏེ་ཕྱིར་རྒོལ་བར་རྗེས་སུ་བལྟ་བར་གནས་པའི་བར་དེར། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One has a correct understanding, whether he considers impermanence, and so forth, up until . . . whether he considers opposition.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྨིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of ripening,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་སྨིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of ripening.

source: བདེ་བ་ལ་བཙུད་པ་ནི་རྣམ་པར་སྨིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: That is the knowledge of cessation as related to knowledge of ripening.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་སྨིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of ripening.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྨིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of ripening,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་སྨིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of ripening.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཤེས་པ་གང་གིས་རྣམ་པར་སྨིན་པ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of ripening.

source: གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་བལྟ་བར་གནས་པ་སྟེ།
en: This is so whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་སྨིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of ripening.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྨིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of ripening,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the paths that lead to all destinations.

source: འདི་ལྟར་ཞུགས་པ་ནི་གཤིན་རྗེའི་འཇིག་རྟེན་དུ་སྐྱེའོ། །
en: ‘This journey will lead to birth in the realm of the Lord of Death.

source: འདི་ལྟར་ཞུགས་པ་ནི་ལྷ་མ་ཡིན་དུ་སྐྱེའོ། །
en: This journey will lead to birth in the realm of the demigods.

source: འདི་ལྟར་ཞུགས་པ་ནི་མིར་སྐྱེའོ་ཞེས་བྱ་བ་ནས།
en: This journey will lead to birth in the human realm, and so forth,

source: འདི་ལྟར་ཞུགས་པ་ནི་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་བར་དུ་སྐྱེའོ། །
en: up until . . . . This journey will lead to birth in the sphere of neither notion nor no notion.

source: འདི་ལྟར་ཞུགས་པ་ནི་ལྷར་སྐྱེའོ། །
en: This journey will lead to birth as a god.

source: འདི་ནི་མིར་སྐྱེའོ། །
en: This person will be born as a human.’

source: ཞེས་ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of the paths that lead to all destinations.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the paths that lead to all destinations,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the paths that lead to all destinations.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་པ་རྣམས་ལ་དགེ་བའི་རྩ་བ་སྐྱེད་ནས། ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་དེ།
en: He has gained knowledge of the origin , having accumulated roots of virtue in the presence of limitless blessed buddhas.

source: ཁྱིམ་བདག་གཞན་ཡང་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, moreover, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of the paths that lead to all destinations.

source: གལ་ཏེ་མི་རྟག་པར་རྗེས་སུ་བལྟ་བར་གནས་པ་ནས། གལ་ཏེ་ཕྱིར་རྒོལ་བར་རྗེས་སུ་བལྟ་བར་གནས་པའི་བར་དེ།
en: whether he considers impermanence, and so forth, up until . . . whether he considers opposition.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the paths that lead to all destinations.

source: ཁྱིམ་བདག་འདི་ལ་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་འགོག་པ་ཤེས་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, he correctly understands those causes and conditions that accomplish the knowledge of cessation as related to knowledge of the paths that lead to all destinations.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the paths that lead to all destinations,

source: བསྐལ་པར་ལན་གསུང་བ་ནས། དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་། ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: he can respond for an eon, and so forth, up until . . . . Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན། དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the paths that lead to all destinations.

source: ཁྱིམ་བདག་འདི་ལ་ཤེས་པ་གང་གིས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the paths that lead to all destinations.

source: གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་ལྟ་བར་གནས་པ་སྟེ།
en: This is so whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the several elements.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་མིག་གི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Householder, in this regard, the Thus-Gone One correctly understands the knowledge of the eye element.

source: མིག་གི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། མིག་གི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས། མིག་གི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the eye element, the knowledge of cessation as related to knowledge of the eye element, and the knowledge of the path that leads to cessation as related to knowledge of the eye element.

source: གཟུགས་ཀྱི་ཁམས་ཤེས་ཏེ་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། གཟུགས་ཀྱི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands the knowledge of the form element, the knowledge of the origin as related to knowledge of the form element, the knowledge of cessation as related to knowledge of the form element, and the knowledge of the path that leads to cessation as related to knowledge of the form element.

source: མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་ཏེ། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands the knowledge of the eye consciousness element, the knowledge of the origin as related to knowledge of the eye consciousness element, the knowledge of cessation as related to knowledge of the eye consciousness element, and the knowledge of the path that leads to cessation as related to knowledge of the eye consciousness element.

source: རྣ་བའི་ཁམས་དང་། སྒྲའི་ཁམས་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། སྣའི་ཁམས་དང་། དྲིའི་ཁམས་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ལྕེའི་ཁམས་དང་། རོའི་ཁམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ལུས་ཀྱི་ཁམས་དང་། རེག་བྱའི་ཁམས་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་སོ། །
en: he [correctly understands] the knowledge of the ear element, the sound element, and the ear consciousness element; the nose element, the smell element, and the nose consciousness element; the tongue element, the taste element, and the tongue consciousness element; and the body element, the texture element, and the body consciousness element.

source: ཡིད་ཀྱི་ཁམས་ཤེས་ཏེ། ཡིད་ཀྱི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ཡིད་ཀྱི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས། ཡིད་ཀྱི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་སོ། །
en: “He [correctly understands] the knowledge of the mind element, the knowledge of the origin as related to knowledge of the mind element, the knowledge of cessation as related to knowledge of the mind element, and the knowledge of the path that leads to cessation as related to knowledge of the mind element.
